/*********************************************************************/
/*                                                                   */
/*              Библиотека обмена сообщениями по TCP                 */
/*                                                                   */
/*********************************************************************/

#include <stddef.h>
#include <stdio.h>
#include <string.h>
#include <time.h>

#include "exh.h"

#pragma warning(disable : 4996)

/*********************************************************************/
/*********************************************************************/
/**							            **/
/**             	КЛАСС - МЕНЕДЖЕР ОБМЕНА		            **/
/**							            **/
/*********************************************************************/
/*********************************************************************/

/*********************************************************************/
/*								     */
/*		       Конструктор класса			     */

     Tcp_exchange::Tcp_exchange(void)

{
}


/*********************************************************************/
/*								     */
/*		        Деструктор класса			     */

    Tcp_exchange::~Tcp_exchange(void)

{
}


/*********************************************************************/
/*								     */
/*		     Обмен Клиент-Сервер                             */

   int  Tcp_exchange::Exchange(Tcp_packet *send, Tcp_packet *recv)

{
   return(0) ;
}


/*********************************************************************/
/*								     */
/*                Закрытие соединения                                */

   int  Tcp_exchange::vCloseConnect(void *client)
{  
    return(0) ;
}


/*********************************************************************/
/*								     */
/*                Обработка полученных данных                        */

   int  Tcp_exchange::vProcessData(Tcp_job *job, void  *connect)
{  
              job->packet.data_out.assign("SUCCESS") ;
              job->done_flag      = 1 ;  

    return(0) ;
}


/*********************************************************************/
/*								     */
/*                Обработчик внешнего управления                     */

   int  Tcp_exchange::vExternControl(void)
{  
    return(0) ;
}


/*********************************************************************/
/*								     */
/*	  	          Ведение лог-файла                          */

   int  Tcp_exchange::iLog_file(char *text)

{
  FILE *file ;


   if(mLog_file[0]==0)  return(0) ;
    
      file=fopen(mLog_file, "a") ;
   if(file==NULL)  return(0) ;

	 fwrite(text, 1, strlen(text), file) ;
	 fwrite("\n", 1, strlen("\n"), file) ;
	 fclose(file) ;

   return(0) ;
}


